#melt()

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book8.csv')
df

       Genre  year  budget  rating
0     Action  2008      28      48
1     Action  2009     200      63
2     Action  2008      32      57
3     Action  2010      20      52
4  Adventure  2009      18      84
5  Adventure  2010     105      44
6     Comedy  2010      20      70
7     Comedy  2008       8      81
8     Comedy  2009      30      71

In [3]:
pd.melt(df)

   variable      value
0     Genre     Action
1     Genre     Action
2     Genre     Action
3     Genre     Action
4     Genre  Adventure
5     Genre  Adventure
6     Genre     Comedy
7     Genre     Comedy
8     Genre     Comedy
9      year       2008
10     year       2009
11     year       2008
12     year       2010
13     year       2009
14     year       2010
15     year       2010
16     year       2008
17     year       2009
18   budget         28
19   budget        200
20   budget         32
21   budget         20
22   budget         18
23   budget        105
24   budget         20
25   budget          8
26   budget         30
27   rating         48
28   rating         63
29   rating         57
30   rating         52
31   rating         84
32   rating         44
33   rating         70
34   rating         81
35   rating         71

In [4]:
pd.melt(df,id_vars=['Genre'])

        Genre variable  value
0      Action     year   2008
1      Action     year   2009
2      Action     year   2008
3      Action     year   2010
4   Adventure     year   2009
5   Adventure     year   2010
6      Comedy     year   2010
7      Comedy     year   2008
8      Comedy     year   2009
9      Action   budget     28
10     Action   budget    200
11     Action   budget     32
12     Action   budget     20
13  Adventure   budget     18
14  Adventure   budget    105
15     Comedy   budget     20
16     Comedy   budget      8
17     Comedy   budget     30
18     Action   rating     48
19     Action   rating     63
20     Action   rating     57
21     Action   rating     52
22  Adventure   rating     84
23  Adventure   rating     44
24     Comedy   rating     70
25     Comedy   rating     81
26     Comedy   rating     71

In [5]:
pd.melt(df,id_vars=['year'])

    year variable      value
0   2008    Genre     Action
1   2009    Genre     Action
2   2008    Genre     Action
3   2010    Genre     Action
4   2009    Genre  Adventure
5   2010    Genre  Adventure
6   2010    Genre     Comedy
7   2008    Genre     Comedy
8   2009    Genre     Comedy
9   2008   budget         28
10  2009   budget        200
11  2008   budget         32
12  2010   budget         20
13  2009   budget         18
14  2010   budget        105
15  2010   budget         20
16  2008   budget          8
17  2009   budget         30
18  2008   rating         48
19  2009   rating         63
20  2008   rating         57
21  2010   rating         52
22  2009   rating         84
23  2010   rating         44
24  2010   rating         70
25  2008   rating         81
26  2009   rating         71

In [6]:
pd.melt(df,id_vars=['year'],value_vars=['Genre'])

   year variable      value
0  2008    Genre     Action
1  2009    Genre     Action
2  2008    Genre     Action
3  2010    Genre     Action
4  2009    Genre  Adventure
5  2010    Genre  Adventure
6  2010    Genre     Comedy
7  2008    Genre     Comedy
8  2009    Genre     Comedy

In [7]:
pd.melt(df,id_vars=['year'],value_vars=['Genre'],var_name=['Category'])

   year Category      value
0  2008    Genre     Action
1  2009    Genre     Action
2  2008    Genre     Action
3  2010    Genre     Action
4  2009    Genre  Adventure
5  2010    Genre  Adventure
6  2010    Genre     Comedy
7  2008    Genre     Comedy
8  2009    Genre     Comedy

In [9]:
pd.melt(df,id_vars=['year'],value_vars=['Genre'],var_name=['Category'],value_name='Data')

   year Category       Data
0  2008    Genre     Action
1  2009    Genre     Action
2  2008    Genre     Action
3  2010    Genre     Action
4  2009    Genre  Adventure
5  2010    Genre  Adventure
6  2010    Genre     Comedy
7  2008    Genre     Comedy
8  2009    Genre     Comedy